---
kind: other
id: Methods.T:Autodesk.Revit.DB.TessellatedShapeBuilderResult
source: html/93f8723c-ce28-1187-c5e4-e2533839bd7f.htm
---
# TessellatedShapeBuilderResult Methods

When called the first time, returns geometrical objects which were built.
 Later calls will throw exceptions.